LBH9527/ESLink-II/bsp/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT4_FTM1CH0SRC_FTM 0x00u     /*!<@brief FTM1 channel 0 input capture source select: FTM1_CH0 signal */
#define SOPT4_FTM1CLKSEL_CLK0 0x00u    /*!<@brief FTM1 External Clock Pin Select: FTM_CLK0 pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTC4 (number 49), ES_RST
  @{ */
#define BOARD_ES_RST_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_ES_RST_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_ES_RST_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_ES_RST_GPIO_PIN 4U                        /*!<@brief PORTC pin index: 4 */
#define BOARD_ES_RST_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_ES_RST_PIN 4U                             /*!<@brief PORTC pin index: 4 */
#define BOARD_ES_RST_CHANNEL 4                          /*!<@brief GPIOC GPIO channel: 4 */
#define BOARD_ES_RST_PIN_NAME PTC4                      /*!<@brief Pin name */
#define BOARD_ES_RST_LABEL "ES_RST"                     /*!<@brief Label */
#define BOARD_ES_RST_NAME "ES_RST"                      /*!<@brief Identifier name */
#define BOARD_ES_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                        /* @} */

/*! @name PORTC8 (number 53), ES_SCK_EN
  @{ */
#define BOARD_ES_SCK_EN_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_ES_SCK_EN_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_ES_SCK_EN_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_ES_SCK_EN_GPIO_PIN 8U                        /*!<@brief PORTC pin index: 8 */
#define BOARD_ES_SCK_EN_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_ES_SCK_EN_PIN 8U                             /*!<@brief PORTC pin index: 8 */
#define BOARD_ES_SCK_EN_CHANNEL 8                          /*!<@brief GPIOC GPIO channel: 8 */
#define BOARD_ES_SCK_EN_PIN_NAME PTC8                      /*!<@brief Pin name */
#define BOARD_ES_SCK_EN_LABEL "ES_SCK_EN"                  /*!<@brief Label */
#define BOARD_ES_SCK_EN_NAME "ES_SCK_EN"                   /*!<@brief Identifier name */
#define BOARD_ES_SCK_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                           /* @} */

/*! @name PORTC9 (number 54), ES_DO_EN
  @{ */
#define BOARD_ES_DO_EN_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_ES_DO_EN_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_ES_DO_EN_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_ES_DO_EN_GPIO_PIN 9U                        /*!<@brief PORTC pin index: 9 */
#define BOARD_ES_DO_EN_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_ES_DO_EN_PIN 9U                             /*!<@brief PORTC pin index: 9 */
#define BOARD_ES_DO_EN_CHANNEL 9                          /*!<@brief GPIOC GPIO channel: 9 */
#define BOARD_ES_DO_EN_PIN_NAME PTC9                      /*!<@brief Pin name */
#define BOARD_ES_DO_EN_LABEL "ES_DO_EN"                   /*!<@brief Label */
#define BOARD_ES_DO_EN_NAME "ES_DO_EN"                    /*!<@brief Identifier name */
#define BOARD_ES_DO_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                          /* @} */

/*! @name PORTC10 (number 55), ES_CTL_IO
  @{ */
#define BOARD_ES_CTL_IO_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_ES_CTL_IO_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_ES_CTL_IO_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_ES_CTL_IO_GPIO_PIN 10U                       /*!<@brief PORTC pin index: 10 */
#define BOARD_ES_CTL_IO_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_ES_CTL_IO_PIN 10U                            /*!<@brief PORTC pin index: 10 */
#define BOARD_ES_CTL_IO_CHANNEL 10                         /*!<@brief GPIOC GPIO channel: 10 */
#define BOARD_ES_CTL_IO_PIN_NAME PTC10                     /*!<@brief Pin name */
#define BOARD_ES_CTL_IO_LABEL "ES_CTL_IO"                  /*!<@brief Label */
#define BOARD_ES_CTL_IO_NAME "ES_CTL_IO"                   /*!<@brief Identifier name */
#define BOARD_ES_CTL_IO_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                           /* @} */

/*! @name PORTA1 (number 23), KEY0
  @{ */
#define BOARD_KEY0_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_KEY0_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_KEY0_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_KEY0_GPIO_PIN 1U                       /*!<@brief PORTA pin index: 1 */
#define BOARD_KEY0_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_KEY0_PIN 1U                            /*!<@brief PORTA pin index: 1 */
#define BOARD_KEY0_CHANNEL 1                         /*!<@brief GPIOA GPIO channel: 1 */
#define BOARD_KEY0_PIN_NAME PTA1                     /*!<@brief Pin name */
#define BOARD_KEY0_LABEL "KEY0"                      /*!<@brief Label */
#define BOARD_KEY0_NAME "KEY0"                       /*!<@brief Identifier name */
#define BOARD_KEY0_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                     /* @} */

/*! @name PORTA2 (number 24), KEY2
  @{ */
#define BOARD_KEY2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_KEY2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_KEY2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_KEY2_GPIO_PIN 2U                       /*!<@brief PORTA pin index: 2 */
#define BOARD_KEY2_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_KEY2_PIN 2U                            /*!<@brief PORTA pin index: 2 */
#define BOARD_KEY2_CHANNEL 2                         /*!<@brief GPIOA GPIO channel: 2 */
#define BOARD_KEY2_PIN_NAME PTA2                     /*!<@brief Pin name */
#define BOARD_KEY2_LABEL "KEY2"                      /*!<@brief Label */
#define BOARD_KEY2_NAME "KEY2"                       /*!<@brief Identifier name */
#define BOARD_KEY2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                     /* @} */

/*! @name PORTA4 (number 26), KEY1
  @{ */
#define BOARD_KEY1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_KEY1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_KEY1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_KEY1_GPIO_PIN 4U                       /*!<@brief PORTA pin index: 4 */
#define BOARD_KEY1_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_KEY1_PIN 4U                            /*!<@brief PORTA pin index: 4 */
#define BOARD_KEY1_CHANNEL 4                         /*!<@brief GPIOA GPIO channel: 4 */
#define BOARD_KEY1_PIN_NAME PTA4                     /*!<@brief Pin name */
#define BOARD_KEY1_LABEL "KEY1"                      /*!<@brief Label */
#define BOARD_KEY1_NAME "KEY1"                       /*!<@brief Identifier name */
#define BOARD_KEY1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                     /* @} */

/*! @name PORTA5 (number 27), LED_G/PASS_OUT
  @{ */
#define BOARD_LED_G_PASS_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_LED_G_PASS_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_LED_G_PASS_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_LED_G_PASS_GPIO_PIN 5U                        /*!<@brief PORTA pin index: 5 */
#define BOARD_LED_G_PASS_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_LED_G_PASS_PIN 5U                             /*!<@brief PORTA pin index: 5 */
#define BOARD_LED_G_PASS_CHANNEL 5                          /*!<@brief GPIOA GPIO channel: 5 */
#define BOARD_LED_G_PASS_PIN_NAME PTA5                      /*!<@brief Pin name */
#define BOARD_LED_G_PASS_LABEL "LED_G/PASS_OUT"             /*!<@brief Label */
#define BOARD_LED_G_PASS_NAME "LED_G_PASS"                  /*!<@brief Identifier name */
#define BOARD_LED_G_PASS_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                            /* @} */

